[
  {
    "title": ".NET Software engineer",
    "company": "Prodrive technologies",
    "start": "01/02/2021",
    "end": "01/12/2024",
    "description": "As a .NET Software Engineer, I specialized in developing and maintaining the back-end of a WPF application, focusing on creating robust and efficient solutions for PCB testing machines. My primary responsibilities included designing and implementing algorithms to generate test files for various PCB testing processes, such as interconnection tests and chip programming. These algorithms ensured the accuracy and reliability of the testing procedures, contributing to the overall quality of the products.\n\nOne of my key contributions was the development of a predictive database system designed to identify when a product would generate a high number of false calls during testing. By analyzing the components on the PCB and comparing them to historical data on false calls from testing machines, the system could predict potential issues before they occurred. This allowed test engineers to proactively fine-tune product tests before production, rather than during, significantly reducing downtime on the production line. This solution was particularly critical given the company's vast product variation, which made tuning during production impractical and costly.\n\nAdditionally, I created an internal web application to streamline code documentation for engineers. The solution allowed engineers to write documentation in MDX files, which were stored alongside the actual code in the software solution. This approach ensured that documentation was always in close proximity to the code it described, making it easier to update and maintain. When a branch was merged into the main Git branch, the Bamboo CI/CD pipeline would notify the website, which would then check for new or updated MDX files. These files were automatically parsed and converted into static HTML pages, ensuring that the documentation was always up-to-date and accessible.\n\nThrough these projects, I gained a deep understanding of the .NET ecosystem, as well as extensive experience with React and TypeScript, which were used to build the front-end of the internal web application. My work required a strong focus on problem-solving, attention to detail, and the ability to collaborate effectively with cross-functional teams to deliver high-quality software solutions."
  }
]